<template>
  <div class="ui-main clear" id="helpWord-c1">
            <div class="con_box">
                <div class="help-con">
                            <div class="help-head">
                                1 你们合法吗？
                            </div>
                            <div class="help-main">
                                <p>我们是合法的网络博彩娱乐公司。15亿彩票娱乐为彩界后起之秀利新集团打造的线上彩票娱乐品牌，一期资金7000万美金以上，目标是全力打造彩界最快、最稳、服务至上为首的娱乐平台，本公司注册于英属维京群岛。</p><p>是由菲律宾政府北卡格扬经济特区 North Cagayan Gaming Amusement Corporation 所授权和监管， 并获得菲律宾North Cagayan博彩牌照，依菲律宾博彩法规合法经营，NCGAC博彩牌照No.12-OCGO-012。请您遵守您当地的法律进行娱乐。</p><p>主营业务范围包括在线彩票等网上娱乐项目，集团在全球各地取得政府合法授权经营开发包含有赌场的旅游度假酒店经营权、注资亚洲金融和云数据技术等高新行业领域。集团雄厚的资金和技术支撑背景，为15亿彩票娱乐项目长期稳定发展保驾护航。
                            </p></div>
                            <div class="help-head">
                                2 如何保障帐号安全？
                            </div>
                            <div class="help-main">
                                <p>1. 首次获得平台账户之后，请修改初始登录密码并设定账户提款密码，并且绑定您的邮箱和设定您的密保，同时绑定您需要用来充值或者提款的银行账号信息；</p><p>2. 妥善保管您的登录密码和提款密码，平时切勿相信他人以任何理由索要平台账户的登录密码及提款密码以及密保信息， 定期对电脑进行安全检查，避免电脑中病毒和木马导致账户被盗；</p><p>3. 用户输入密码错误超过5次，平台处于对用户账号的安全考虑将临时冻结，需联系客服或上级处理；</p>
                            </div>
                            <div class="help-head">
                                3 为何存款不到帐？
                            </div>
                            <div class="help-main">
                                <p>1. 平台填写的存款金额和网银实际汇款的金额不一致，会导致不到账；</p><p>2. 网银汇款时需要填写的附言（发起充值申请后获得的订单号/附言）填写错误或未填写；</p><p>3. 没有使用网银进行汇款（如使用银行柜台或ATM汇款无法到账）；</p><p>4. 存款时没有从平台发起存款请求或者没有使用平台最新的收款银行信息；</p><p>5. 如因用户没有使用平台的最新收款信息而汇款到旧的收款银行账号而导致资金损失，须由用户自行承担；</p><p>6. 充值超过15分钟未到账请咨询在线客服，并提供平台用户名及汇款详情单（包含汇款人姓名、卡号、汇款具体时间及金额）；</p><p>7. 充值时间在平台服务时间外或银行系统维护时。</p>
                            </div>
                            <div class="help-head">
                                4 平台对于提款有何规定？
                            </div>
                            <div class="help-main">
                                <p>1. 对于新开的用户需要自开户6小时后方可发起提款；</p><p>2. 新增银行卡（含新增，修改）6个小时后方可发起提款；</p><p>3. 存款后总投注额小于总存款额30%的提款将不予受理，提款金额将退回用户平台账户。</p>
                            </div>
                            <div class="help-head">
                                5 如何投注？
                            </div>
                            <div class="help-main">
                                <p>请您按以下提示进行操作投注：</p><p>&nbsp;&nbsp;a)选择彩种和玩法，玩法组标签可以来回相互切换，然后选择不同的玩法；</p><p>&nbsp;&nbsp;b)根据各个玩法规则，选择或者输入要购买的号码；</p><p>&nbsp;&nbsp;c)然后根据需要选择投注倍数、元角分等模式和奖金返点设置；</p><p>&nbsp;&nbsp;d)确认选择的号码，然后点击“确认选号”，把当前投注内容加入到投注项中，然后可以重复""a""到""d""，以添加不同玩法的不同投注内容到投注项中；</p>
                            </div>
                            <div class="help-head">
                                6 为什么我无法进行游戏撤单？
                            </div>
                            <div class="help-main">
                                <p>若您想要撤单，需要在当期销售截止之前进行撤单。如果当期已经截止销售，那么将无法再进行撤单操作；</p><p>1. 任何彩种的撤单都必须在该奖期停止投注之前进行操作，当期投注时间截止后该投注单将无法再进行撤单操作；</p><p>2. 在投注页面下方的游戏记录可以进行撤单操作；</p>
                            </div>
                            <div class="help-head">
                                7 投注记录-购彩查询
                            </div>
                            <div class="help-main">
                                <p>&nbsp;&nbsp;用户中心&gt;投注记录&gt;购彩查询,设定自已查询条可以查看到投注记录,同时点注单编号可以查询到详细的注单内容。</p>
                            </div>
                            <div class="help-head">
                                8 投注记录&gt;追号查询
                            </div>
                            <div class="help-main">
                                <p>&nbsp;&nbsp;和购彩查询类似，默认不显示任何追号记录，需要在选择查询条件以后，点击搜索才能查询追号记录，在查询出的记录结果里，点击追号内容栏的“详细号码”，可以在当页浮动显示出该追号记录所选择的号码，点击追号编号会新打开一个追号详情窗口，在追号详情中可以对销售未截止或者未开始的奖期进行撤消追号处理。</p>
                            </div>
                            <div class="help-head">
                                9 什么是“奖金限额”？平台奖金限额是多少？
                            </div>
                            <div class="help-main">
                                <p>1. 每个账号在同一游戏、同一玩法、同一奖期中购买相同号码的最大可中奖金额；</p><p>2. 高频彩（时时彩、时时乐、11选5）的奖金限额30万（官彩玩法和信用玩法单期总共可中奖金额最高为30万），低频彩（3D、排列三/五）的奖金限额10万。</p>
                            </div>
                            <div class="help-head">
                                10 什么是动态奖金返点？
                            </div>
                            <div class="help-main">
                                <p>&nbsp;&nbsp;在投注的时候，会有个“选择奖金返点”，即动态奖金返点。动态奖金返点是根据用户自身的返点，然后利用舍弃返点，来提高中奖金额的一种模式，比如您重庆时时彩的前三直选的奖金是1800，返点是7%，那么在投注的时候可以选择动态奖金1940，返点0%。这种情况下如果您中奖，那么奖金便是1940</p>
                            </div>
                            <div class="help-head">
                                11 关于第3方开奖机构不开奖问题？
                            </div>
                            <div class="help-main">
                                <p>1. 所有游戏，如遇第3方开奖机构不开奖，平台会对未获得开奖号码的期数进行撤单返款；</p><p>2. 撤单后无论第三方以任何形式补开，平台均维持撤单处理。</p>
                            </div>
                            <div class="help-head">
                                12 无法绑定银行卡的原因：
                            </div>
                            <div class="help-main">
                                <p>1.您的这张银行卡在之前是否被绑定过（不可以重复绑定）；</p><p>2.您的开户人姓名是否与已绑定的银行卡开户人是一样的；</p><p>3.点击“绑定银行卡”后的第一步是验证已经绑定在平台上的银行卡，这一步需要输入的是已绑定的银行卡信息，不是新绑定的银行卡信息；</p><p>4.您填写的银行卡不正确。</p>
                            </div>
                            <div class="help-head">
                                13 如何查询账变？
                            </div>
                            <div class="help-main">
                                <p>登陆账户后，进入“报表管理”后点击“账变报表”，即可以查看到您所有的存提款和账变记录。如只需要查看存提款记录，也可只进入“报表管理”点击“线上支付”或“公司入款”进行查看。</p>
                            </div>
                            <div class="help-head">
                                14 如何查询报表盈亏？
                            </div>
                            <div class="help-main">
                                <p>登陆账户后，进入“报表管理”，点击“个人报表”，设定时间范围以及游戏，点击“查询”即可查询到您在设定时间段的销售及返点总额，以及总的盈亏。</p>
                            </div>
                            <div class="help-head">
                                15 单挑规则说明？
                            </div>
                            <div class="help-main">
                                <p>投注的中奖概率低于或等于1％的均为单挑模式。例如：1)[五星直选]1000注及以内，[四星直选]100注及以内，[三星直选]10注及以内，[二星直选]4注及以内，[五星组选120]10注及以内，[五星组选60]20注及以内，[五星组选30]35注及以内，[五星组选20]50注及以内，[五星组选10]90注及以内，[五星组选5]90注及以内，[四星组选24]5注及以内，[四星组选12]10注及以内，[四星组选6]20注及以内，[四星组选4]25注及以内，会员单挑同期同一玩法同一位置，中奖利润最高30000元，超出的利润将进行扣除,多个相同单挑注单的同一位置也最多只派奖30000元;2)[三星组六]2注及以内，[三星组三]4注及以内，[二星组选]2注及以内......等等,会员单挑同期同一玩法同一位置，中奖利润最高20000元，超出的利润将进行扣除,多个相同单挑注单的同一位置也最多只派奖20000元。3)平台六合彩以下玩法设为单挑模式,连码三全中,特串,连肖五肖,均列为单挑模式,单挑模式每期单笔奖金最高限额10W元,超过将按10W元反还.如有疑问请联系我们的在线客服进行咨询，谢谢！</p>
                            </div>

                </div>
            </div>
        </div>
</template>

<script>
export default {
    name:'Generalq',
    data () {
        return {
            
        }
    }
}
</script>

<style >
.ui-main {
    background: #ededed;
    margin-left: 213px;
    min-height: 900px;
    min-width: 1600px;
}
.con_box {
    background: #ededed;
    float: left;
    width: 100%;
}
.help-con {
    padding: 30px;
    text-align: left;
}
.help-head {
    border-top: 1px solid #ccc;
    background: #d3d3d3;
    line-height: 30px;
    padding: 0 10px;
    font-size: 16px;
}
.help-main {
    border-left: 1px solid #ccc;
    border-right: 1px solid #ccc;
    border-bottom: 1px solid #ccc;
    padding: 10px;
}
.help-main p {
    padding: 5px;
    margin: 10px;
}
p {
    font-size: 14px;
    color: #666;
}
</style>
