"use strict"
let Iint={
    //求和
    getSum(arr){
        arr =arr.split(",");
        let sum = 0;
        for(let i= 0,len=arr.length;i<len;i++){
            sum += parseInt(arr[i]);
        }
        return sum;
    },
    getjx: {
        '200': {
            '万位': {
                '万定位': ['大', '小', '单', '双'],
            },
            '仟位': {
                '仟定位': ['大', '小', '单', '双']
            },
            '佰位': {
                '佰定位': ['大', '小', '单', '双']
            },
            '拾位': {
                '拾定位': ['大', '小', '单', '双',]
            },
            '个位': {
                '个定位': ['大', '小', '单', '双']
            },

        },
        "204": {
           '单号1-10':{
               '冠军': ['大', '小', '单', '双'],
               '亚军': ['大', '小', '单', '双'],
               '季军': ['大', '小', '单', '双'],
               '第四名': ['大', '小', '单', '双'],
               '第五名': ['大', '小', '单', '双'],
               '第六名': ['大', '小', '单', '双'],
               '第七名': ['大', '小', '单', '双'],
               '第八名': ['大', '小', '单', '双'],
               '第九名': ['大', '小', '单', '双'],
               '第十名': ['大', '小', '单', '双']
           }
        },
        "201":{
            '整合':{
                '第一球': ['大', '小', '单', '双'],
                '第二球': ['大', '小', '单', '双'],
                '第三球': ['大', '小', '单', '双'],
                '第四球': ['大', '小', '单', '双'],
                '第五球': ['大', '小', '单', '双'],
                '第六球': ['大', '小', '单', '双'],
                '第七球': ['大', '小', '单', '双'],
                '第八球': ['大', '小', '单', '双']
            },
            '第一球':{
                '第一球': ['大', '小', '单', '双']
            },
            '第二球':{
                '第二球': ['大', '小', '单', '双']
            },
            '第三球':{
                '第三球': ['大', '小', '单', '双']
            },
            '第四球':{
                '第四球': ['大', '小', '单', '双']
            },
            '第五球':{
                '第五球': ['大', '小', '单', '双']
            },
            '第六球':{
                '第六球': ['大', '小', '单', '双']
            },
            '第七球':{
                '第七球': ['大', '小', '单', '双']
            },
            '第八球':{
                '第八球': ['大', '小', '单', '双']
            }
        },
        "205":{
            '整合': {
                '第一球': ['大', '小', '单', '双'],
                '第二球': ['大', '小', '单', '双'],
                '第三球': ['大', '小', '单', '双'],
            },
            '第一球':{
                '第一球': ['大', '小', '单', '双']
            },
            '第二球':{
                '第二球': ['大', '小', '单', '双']
            },
            '第三球':{
                '第三球': ['大', '小', '单', '双']
            }
        },
        "206":{
            '整合': {
                '第一球': ['大', '小', '单', '双'],
                '第二球': ['大', '小', '单', '双'],
                '第三球': ['大', '小', '单', '双'],
            },
            '第一球':{
                '第一球': ['大', '小', '单', '双']
            },
            '第二球':{
                '第二球': ['大', '小', '单', '双']
            },
            '第三球':{
                '第三球': ['大', '小', '单', '双']
            }
        },
        "202":{
            '整合': {
                '第一球': ['大', '小', '单', '双'],
                '第二球': ['大', '小', '单', '双'],
                '第三球': ['大', '小', '单', '双'],
                '第四球': ['大', '小', '单', '双'],
                '第五球': ['大', '小', '单', '双'],
            },
            '万位': {
                '万定位': ['大', '小', '单', '双'],
            },
            '仟位': {
                '仟定位': ['大', '小', '单', '双']
            },
            '佰位': {
                '佰定位': ['大', '小', '单', '双']
            },
            '拾位': {
                '拾定位': ['大', '小', '单', '双',]
            },
            '个位': {
                '个定位': ['大', '小', '单', '双']
            },
        },
        "203":{
            '正码': {
                '总和': ['大', '小', '单', '双'],
            },
         },
        "six":{
            '特别号A': ['大', '小', '单', '双','红波', '蓝波', '绿波','兔','虎', '牛', '鼠', '猪','狗', '鸡', '猴', '羊','马', '蛇', '龙', '家禽','野兽'
                ],
        },
        "207":{
          '大小骰宝':[]
        },
        "209":{

        },
        "210":{
            '万位': {
                '万定位': ['大', '小', '单', '双'],
            },
            '仟位': {
                '仟定位': ['大', '小', '单', '双']
            },
            '佰位': {
                '佰定位': ['大', '小', '单', '双']
            },
            '拾位': {
                '拾定位': ['大', '小', '单', '双',]
            },
            '个位': {
                '个定位': ['大', '小', '单', '双']
            },
        }
    },
    getTitle(obj,id){
        for(let k in obj){
            let v = obj[k].type;
            for(let i=0,len=v.length;i<len;i++){
                if(v[i].name == id){
                    return obj[k].id;
                }
            }
        }
    },
    getId(obj,id){
        for(let k in obj){
            let v = obj[k].type;
            for(let i=0,len=v.length;i<len;i++){
                if(v[i].name == id){
                    return v[i].lot_id;
                }
            }
        }
    },
}
export default Iint;


